[{"title":"Ice Skating at Alpine Winter Village","link":"http://www.adelaidecitycouncil.com/whats-on/event/alpine-winter-village-1","author":"","date":"2016-07-07T10:00:00","description":"The Alpine Winter Village brings the best of the European festive season to the Adelaide Riverbank. There\u0027s plenty to keep you entertained and warm with an open-air ice rink, mulled wine, hot food, markets and live music, making the village an all-ages, go-to destination this July.\n\nA program of day and night activities will run throughout the month, offering families a fun-filled way to keep the kids entertained during the school holidays, with live performances leading into the evenings - perfect for the after-work crowd.\n\nOpen daily from\u0026nbsp;10.00am - midnight\n\nENTRY\n\n*Patrons who have pre-purchased ice skating sessions will not incur the entry cover charge\n\nSKATING TICKETS\n\n$0.50 booking fee per ticket applies to all ticket purchases and a 1.5% surcharge applies to all card payments.\n","loc":{"latitude":29.8357192,"longitude":-95.39405269999999}},{"title":"Unleashed","link":"http://www.adelaidecitycouncil.com/whats-on/event/unleashed","author":"","date":"2016-07-29T18:00:00","description":"Unleashed is South Australia’s annual Open Data competition, which is part of the GovHack competition held across Australia and New Zealand. Over one weekend, teams use Open Data that has been made available by government to showcase how we can create innovative services for South Australians.\n\nAdelaide – Unleashed, The Arts \u0026amp; MOD\n\nHosted by the\u0026nbsp;University of South Australia\n\nInnovation and Collaboration Centre (ICC)\nLevel 4, Catherine Helen Spence Building\nUniversity of South Australia, City West Campus\n(enter off Fenn Place).\n\nFriday 29 July, 6.00 pm – 10.00 pm – Supper provided\nSaturday 30 July, 7.30 am – 10.00\u0026nbsp;pm – Breakfast/lunch/tea\nSunday 31 July,\u0026nbsp; 8.00 am – 6.00 pm – Breakfast/Lunch\n\n2016 Unleashed Venue Information – Adelaide\n\nInformation for Unleashed Makers:\n\nIf you’re a maker, you’ll need to know some important information about the Adelaide Unleashed Maker Space.\n\nFor more information on Unleashed ADL click here!\n"},{"title":"Save The Ramindjeri Culture Centre","link":"http://www.adelaidecitycouncil.com/whats-on/event/save-the-ramindjeri-culture-centre","author":"","date":"2016-07-30T12:00:00","description":"This sacred place, known as the Gateway to the Heavens, is an elemental part of the fabric of Original Spirituality and Culture, and will cease to exist once they are forced off their land.\n\nRaising awareness and funds to stop the closure of this important cultural centre and potential home of marked rock artifact collection.\n\nThis collection of rocks will be on display at the meeting to be held at The Irish Club in Adelaide on Saturday 30, to present the circumstances surrounding this tragic turn of events. We will also present an amazingly different version of Original history and archaeology, which not only rewrites world history, but was inspired and directed by the esteemed Ramindjeri Elder Karno W. We ask that you come along to support the fight against this injustice.\n","loc":{"latitude":-34.9317447,"longitude":138.6008847}},{"title":"Repsychedelic - SALA exhibition 2016","link":"http://www.adelaidecitycouncil.com/whats-on/event/repsychedelic-sala-exhibition-2016","author":"","date":"2016-07-30T18:00:00","description":"Join us on Saturday 30 July at 6pm for the launch of ‘Repsychedelic’; a multi-media exhibition showcasing a variety of works from from artists Emmaline Zanelli, Kaspar Schmidt Mumm, Declan Casley-Smith and Walter Kenyon.\n\nThe exhibition will include elements such as sculpture, painting and photography and aims to raise awareness about the survival of our fragile planet and living with the Earth in its current state.\u0026nbsp;\n\nThe central theme of the exhibition is the metaphor of psychedelia to the deliberate untruthfulness of big business and politics in relation to issues such as climate change. \u0026nbsp;\n\nThe metaphor implies that just as the effects of drug induced psychedelia reduce intensity over time, the time has come to take off the blinkers and see the problems and pressing issues that we all must face.\u0026nbsp;\n\nThe title of the exhibition ‘Repsychedelic’ also relates to the idea of recycling objects to give them a new life.\u0026nbsp;\n\nThe opening night will feature a performance by Kaspar Schmitt Mumm and Declan Casley-Smith based on the theme of the imaginary or spiritual world.\u0026nbsp;\n\nThere will also be all-original performances from bands Legumes and Great Wild.\u0026nbsp;\n\nFood and drinks will be available for purchase on the night.\u0026nbsp;\n\n“As artists, we feel it is our duty to align ourselves with an active morality, to remain passive is unthinkable” - Walter Kenyon.\u0026nbsp;\n\nThis exhibition is part of the South Australia Living Artists (SALA) Festival.\u0026nbsp;\n"},{"title":"A Bus Full of Art","link":"http://www.adelaidecitycouncil.com/whats-on/event/a-bus-full-of-art","author":"","date":"2016-07-31T00:00:00","description":"A Bus Full of Art brings all new artwork to SALA in the Square. Come and see our artists painting in Victoria Square\u0027s artist\u0027s hub and view our exhibition in this unusual mobile art gallery.\u0026nbsp;\n\nGo to our events page at http://www.facebook.com/abusfullofart for full details on who will be painting when.\n"},{"title":"Marked Rocks Two Perspectives- Workshop","link":"http://www.adelaidecitycouncil.com/whats-on/event/marked-rocks-two-perspectives-workshop","author":"","date":"2016-07-31T00:09:00","description":"We open with Ros\u0027 Rock 1 which the Smithsonian call unique, and the Dreaming Story Karno gave, which points out the reasons why the technology on display is so remarkable, and all the science and observations. During this discussion we will have the five Elders each hold a rock. Once we have had our say, the Elders will have the opportunity to have theirs.\u0026nbsp;\ns regarding the First Language and the many esoteric topics.\n\nWe will be filming this historic event as a documentary that goes with the rocks, to be displaued at the Culture Centre on Kangaroo Island, which will be given to Christine, Vivienne, Darren and whoever else is nominated as the Custodians and carers of the rocks.\n\nWe have ten Free seats available for the Original Community Members and Elders (five for Original Community Members and five for Elders in touch with the Old Ways). 25 seats will be made available to the general public at a cost of $40 per ticket\n"},{"title":"David Williamson\u0026#8217;s Emerald City Special Event Screening - Australian National Theatre-Live","link":"http://www.adelaidecitycouncil.com/whats-on/event/david-williamsons-emerald-city-special-event-screening-australian-national-","author":"","date":"2016-07-31T14:00:00","description":"Part love letter, part hate mail to the harbour city,\u0026nbsp;A fast-moving, wisecracking commentary on contemporary urban mores and morals, and the rivalries and passions to be encountered on the road to success. Colin, a screenwriter, and his wife Kate, a publisher, move to the ‘Emerald City’, where fame and fortune are there for the taking, but surprises are in store for them both.\n"},{"title":"Sportivore Social Sports Hub","link":"http://www.adelaidecitycouncil.com/whats-on/event/sportivore-social-sports-hub","author":"","date":"2016-08-01T00:00:00","description":"Sportivore Social Sports Hub is offering people a new and exciting way to play Social Sports on a casual basis in Adelaide City. Games of Soccer, Basketball, Volleyball, Badminton and Touch Football will be held in a variety of locations with fun and fitness being our major focus for participants. Players simply register with sportivore.com.au and join an upcoming game of interest. They\u0026nbsp;regularly host social gatherings after the game which are often supported by local venues with free drinks or nibbles upon arrival. Sportivore Social Sports Hub is a great way of Staying Fit, Having Fun and Meeting new people.\n\nHow it works: Players receive an email with the all the game details when they\u0026nbsp;Join a Game\u0026nbsp;with a confirmation email sent 4 hours prior to the game starting. The confirmation email confirms we have enough players for a game and that weather conditions are reasonable. At this point your Sportivore wallet is debited the game fee. Sportivore take care of the rest providing Balls, Uniforms, and Fun.\n\nHow Much: Game fees range from FREE to $10 and are made via Paypal. Currently Sportivore are offering $11 FREE credit for every new player who adds $7 to their Sportivore wallet. $7 + $11 FREE \u003d $18 credit. Promotions, new sports and FREE events will be held throughout the winter months so check in regularly to the\u0026nbsp;Website\u0026nbsp;or\u0026nbsp;Facebook page\u0026nbsp;to keep up to date with all the opportunities. For more information check\u0026nbsp;sportivore.com.au\u0026nbsp;or email Clinton on admin@sportivore..."},{"title":"Winter Inspiration","link":"http://www.adelaidecitycouncil.com/whats-on/event/winter-inspiration-1","author":"","date":"2016-08-01T08:00:00","description":"Want to stay motivated and write over during the cool breath of winter? We’ve designed the perfect inspirational program for your creative writing. Every day during August, you will be emailed a creative writing prompt to get your day’s writing underway, provide you with discipline and structure and you\u0027ll have the chance to join a dedicated online forum group to share your work and stay motivated. Best of all, it\u0027s a lot of fun!\n\n\n\n\u0027I enjoyed the challenge and discipline of writing everyday with a set topic. These constraints forced me to be creative,\u0027 Jan 2015 (Summer Inspiration).\n"},{"title":"SALA Exhibition - ACH Group ","link":"http://www.adelaidecitycouncil.com/whats-on/event/sala-exhibition-ach-group","author":"","date":"2016-08-01T09:00:00","description":"Promoting and arts community with our \u0027Good Lives for Older People\u0027 approach, ACH Group is excited to be participating in SALA 2016, celebrating the creative talents of our customers, volunteers and staff.\n\nSALA is an open event that promotes the diversity of visual arts across South Australia. \u0026nbsp;This year\u0027s theme is \u0027LOVE; give, share, celebrate\u0027. \u0026nbsp;ACH Group is proud to present six unique exhibition venues, including The Space Between gallery, in Rundle Street Adelaide.\n"},{"title":"Celebrate SALA and the City Library Artist in Residence Program","link":"http://www.adelaidecitycouncil.com/whats-on/event/celebrate-sala-and-the-city-library-artist-in-residence-program","author":"","date":"2016-08-01T10:00:00","description":"Adelaide Libraries \u0026amp; Community Centres will host an eclectic range of artists’ exhibitions during August 2016, celebrating SALA \u0026amp; the City Library Artist in Residence program.\u0026nbsp;\n\nCome \u0026amp; experience a range of new \u0026amp; inspiring artworks in our diverse spaces!\n\nCity Library Artists\n\nTom Folber: A sample of work from Thomas’s ongoing research project into the implications of the digital reproduction in contemporary visual art.\n\nAsami Kato: photographer Asami, has partnered with a Japanese calligraphic artist who paints left handed.\n\nChelle Destefano:\u0026nbsp;Experience Wait of the World \u0026amp; question religion, money, greed \u0026amp; power.\n\nUNISA Ceramics Group:\u0026nbsp;ilk. II is a celebration of choices \u0026amp; personalities expressed within the ceramic medium. Exhibiting artists are Alison Smiles, Fruzi Kenez, Melanie Manser, Nikki Dowdell, Guy Ringwood, Sami Porter \u0026amp; Sophia Philips.\n\nMichelle Brittan: A mythical menagerie of digital artwork.\n\nElise Bonato: Explored community health \u0026amp; wellness through an experimental drawing process, resulting in “The Serial Oracle”.\n\nJimmy Dodd: Community driven art project which revolves around the idea of fantastic “machines to save a city.”\n\nHutt Street Library Artists\n\nZoe Freney: explores the phenomology of motherhood.\n\nJim Williams: The love of horses \u0026amp; the beach are some of the influences in Jim’s work.\n\nTrevor McNamara: abstract contemporary work designed to engage \u0026amp; entertain.\n"},{"title":"AILA SA 2016 Awards Exhibition","link":"http://www.adelaidecitycouncil.com/whats-on/event/aila-sa-2016-awards-exhibition","author":"","date":"2016-08-01T12:00:00","description":"Exhibition of the 2016 AILA awards entries, which showcase the profession of landscape architecture within South Australia.\n\nIn our 50th year AILA has launched the new National Landscape Architecture Awards Program and it provides a key vehicle for the promotion of the achievements and work of landscape architects in Australia. With 12 new categories the exhibition will highlight the importance of leadership, collaboration, creativity and innovation in creating great places.\n\nWe invite you to view the exhibition of the 2016 awards entries and encourage you to invite your colleagues and friends to share our achievements and help showcase the profession of landscape architecture within South Australia.\n\nThe exhibition hosts 27 entries and will be opened at the AILA SA Awards Celebration on Friday 29 July at ODASA on Leigh Street and will be open for the week following, as an opportunity to engage with our members, the public and the many visitors to ODASA during this period.\n"},{"title":"SALA Exhibition \u0026#8216;Creative Fusion\u0026#8217;","link":"http://www.adelaidecitycouncil.com/whats-on/event/sala-exhibition-creative-fusion","author":"","date":"2016-08-01T17:30:00","description":"SALA is arriving at Wunderkammer Gallery for the first time in an exhibition titled \u0027Creative Fusion\u0027! Grab the opportunity to discover unique works by artists Uta Mooney, Judith Hombsch, Lyndy Danby and writer Glenn Stenson. Brought to the Gallery by Contempo Art Collections, the exhibition runs from August 6-27.\n"},{"title":"Living Building Conversations #9 - High Performance Buildings","link":"http://www.adelaidecitycouncil.com/whats-on/event/living-building-conversations-9-high-performance-buildings","author":"","date":"2016-08-03T18:00:00","description":"Energy is a critical issue in Australia affecting decisions made across the board; from policymakers, business leaders, to individual households. In the Adelaide CBD, up to 60% of all greenhouse gas emissions are linked to energy used in the built environment.\n\nTo create a low carbon future there is an imperative to develop high-performance buildings with low operational requirements that reduce energy costs, whilst increasing the nation’s energy security and reducing carbon emissions.\n\nDiscussing how we reduce the need to use energy in buildings is at the core of our next Living Building Conversation. Within the Living Building Challenge framework, we are asked to prioritise optimisation of building design, services and operation to reduce wasteful spending on energy and resources.\n\nJoin us on the 3rd of August to discuss approaches, drivers, barriers and the delivery of high performing buildings with highly skilled Adelaide professionals and experts.\n\nThe Panel\n\n- Paul Davy - Director of Dsquared Consulting\n\n- Stephen Berry - Research Fellow and Manager at UniSA CRC Low Carbon Living Node\n\n- Sabina Douglas-Hill - Project Manager of National Energy Efficient Buildings Project\n\n- Warwick O\u0027Brien - Director of Warwick O\u0027Brien Architects\n\nOur panel will be happy to take questions, so if their is something you would like to discuss, come along and be ready to ask!\n"},{"title":"Indigenous art exhibition - Audrey Brumby - Going for water","link":"http://www.adelaidecitycouncil.com/whats-on/event/indigenous-art-exhibition-audrey-brumby-going-for-water","author":"","date":"2016-08-05T10:00:00","description":"Audrey is now an institution in the Aboriginal Art world... her works have been purchased by Art collectors from throughout Australia and all over the world. It\u0027s only fitting for Indigenu to celebrate 10 years of working with Audrey. We welcome you to the exhibition launch on Friday the 4th of August. As always we will have lovely indigenous inspired foods and we will be featuring wines from our wine sponsor ( Berrigan Wines, Fine Wine of Australia, https://www.berriganwines.com.au/ \u0026nbsp;)\n\n\u0026nbsp;\n\n131 Sturt St Adelaide\n\nhttp://indigenu.com.au/\n"},{"title":"At The Cloisters: L-Fresh The LION\u0026#8217;s Exclusive Adelaide Show","link":"http://www.adelaidecitycouncil.com/whats-on/event/at-the-cloisters-l-fresh-the-lions-exclusive-adelaide-show","author":"","date":"2016-08-05T17:30:00","description":"Australian hip hop artist L-FRESH The LION will headline the event supported by electronic artist and Sydney DJ Ribongia (DJ Set).\u0026nbsp;\n\nThis is the ultimate, boutique University experience and the ideal return to uni for semester two.\n\n\u0026lt;p #333333;\u003d\"\" font-family:\u003d\"\" brandontext-regular,\u003d\"\" sans-serif;\u003d\"\" font-size:\u003d\"\" 14px;\"\u003d\"\"\u0026gt;Tickets to the event include dinner at no extra charge from one of the many pop-up food retailers at the event.\n"},{"title":"Neo Nights: SA Contemporary","link":"http://www.adelaidecitycouncil.com/whats-on/event/neo-nights-sa-contemporary","author":"","date":"2016-08-05T18:00:00","description":"A new program for 13–17 year olds, Neo is proudly presented by the Balnaves Foundation.\u0026nbsp;\n\n\u0027Neo\u0027 means new, youthful, fresh, lately and now. It suggests the spirit of the contemporary, so it is an ideal name for the Gallery\u0027s program of activities and talks led by artists and art lovers just for teen audiences.\u0026nbsp;\n\nNeo Nights pays homage to the contemporary in August with a dynamic program of activities, art and ideas for teens inspired by the work of South Australia’s living artists.\u0026nbsp;\n\nNeo Nights is presented free thanks to The Balnaves Foundation.\u0026nbsp;\n"},{"title":"SALA - \u0026#8216;Creative Fusion\u0026#8217; Launch Night","link":"http://www.adelaidecitycouncil.com/whats-on/event/sala-creative-fusion-launch-night","author":"","date":"2016-08-05T18:30:00","description":"SALA is arriving at Wunderkammer Gallery for the first time in an exhibition titled \u0027Creative Fusion\u0027! Grab the opportunity to discover unique works by artists Uta Mooney, Judith Hombsch, Lyndy Danby and writer Glenn Stenson. Brought to the Gallery by Contempo Art Collections, the exhibition runs from August 6-27.\n\n7pm Launch by Penny Griggs, SALA General Manager\n"},{"title":"Seascape - painting with acrylics on canvas! ","link":"http://www.adelaidecitycouncil.com/whats-on/event/seascape-painting-with-acrylics-on-canvas","author":"","date":"2016-08-06T09:30:00","description":"Taught by Judith Hombsch, this fun three-hour workshop will take you through the conventions of acrylic painting. No experience required and all materials supplied (please bring your own gloves and apron). Cost includes morning tea.\u0026nbsp;\n"},{"title":"Advanced Short Story","link":"http://www.adelaidecitycouncil.com/whats-on/event/advanced-short-story-1","author":"","date":"2016-08-06T10:00:00","description":"This advanced workshop will show short story writers how to study craft and technique, character development and narrative function, voice and tone, ideas and aesthetics specific to short stories, with a focus on how we deploy our skills practically. The emphasis will be on moving away from literary mimicry as we build an awareness of the clichés of conception and form. The writer will emerge more able to write unique and vital stories that light up a reader\u0027s mind.\n\nAttendees will develop: effective use and sense of literary symbolism and the scope and functions of a scene\n\nBlack Rock White City (2015) is shortlisted for the 2016 Miles Franklin. He is a winner of the Ned Kelly Award and the Booranga Prize for his short fiction, and is the author of The Rattler \u0026amp; other stories (2011) and Best Australian Stories 2012 and 2010, in The Big Issue fiction edition and has also been published in many literary journals including Meanjin, The Review of Australian Fiction.\n"},{"title":"Amazing India","link":"http://www.adelaidecitycouncil.com/whats-on/event/amazing-india","author":"","date":"2016-08-06T18:00:00","description":"Amazing India\u0026nbsp;is\u0026nbsp;A local artists’ production that takes you through a journey of Indian classical, contemporary, folk as well as Bollywood songs and dances presented by Kalalaya School of Indian Performing Arts.\n\n\u0026nbsp;\n\n\u0026lt;p border-box;\u003d\"\" margin-bottom:\u003d\"\" 25px;\u003d\"\" font-size:\u003d\"\" 1.6em;\u003d\"\" line-height:\u003d\"\" color:\u003d\"\" #38424d;\u003d\"\" display:\u003d\"\" inherit;\u003d\"\" font-family:\u003d\"\" \u0027source\u003d\"\" sans\u003d\"\" pro\u0027,\u003d\"\" sans-serif;\"\u003d\"\"\u0026gt;Conceived and directed by Ramesh Menon, Director of Kalalaya and choreographed by Priya Ramesh, the dance guru of Kalalaya; the show portrays the vast and vibrant Indian culture.\n"},{"title":"Examining Excellent Picture Books","link":"http://www.adelaidecitycouncil.com/whats-on/event/examining-excellent-picture-books","author":"","date":"2016-08-07T10:00:00","description":"This workshop promises to be a day of inspirational picture book analysis for those who love to read and write them. Throughout the day participants will consider a range of picture books across diverse themes and markets – the under five market, the school market, books about issues, quirky books with a twist, traditional narratives and nonfiction texts. Together participants will dissect what makes these books work and what writers can learn from the outstanding work of others.\n\nProviding an opportunity to reflect on the essential elements of good picture books, this workshop will equip participants with ideas for writing and refining their own stories and suggestions for finding a publisher and a market.\n\nParticipants will learn: the range of picture book genres and tips for writing and editing picture books\n\nBig Rain Coming, has remained continuously in print for over ten years and her recent title, My Dad STILL Thinks He’s Funny, will be published in 2013. Katrina’s work has been featured on children’s television programs such as Wurrawhy, Yamba’s Playtime and Play School and several of her titles have won Notable Book commendations from The Children’s Book Council of Australia.\n"},{"title":"City of Adelaide Band community concert","link":"http://www.adelaidecitycouncil.com/whats-on/event/city-of-adelaide-band-community-concert-1","author":"","date":"2016-08-07T14:00:00","description":""},{"title":"Floating melodies: Original Word","link":"http://www.adelaidecitycouncil.com/whats-on/event/floating-melodies-original-word","author":"","date":"2016-08-07T19:30:00","description":"Nice Verdes are always on some kind of adventure in search of new inspiration and music. They have caught numerous planes, boats, bicycles and hitchhiked to play festivals and shows around the world as well as swinging in a hammock on a boat down the Amazon, hiking up mountains in the Andes, living in a shack in West Africa with no electricity, dancing in the desert at a rain dance, seeing an Orisha ceremony in Cuba, bathing in ancient thermal baths in Budapest, sleeping under the stars in the middle of Australia, gardening on the slopes of the Mediterranean, swimming in the Ganges, planting palms in the jungles of Costa Rica and enjoying Tango in Argentina.\n\nNice Verdes have released two albums, ‘succulence’ in 2008 and ‘brontosaurus’ in 2014. Their music is uplifting and sunny; original indie world. Inspired by the music’s of the world; Cuba, Colombia, Africa, Europe and Latin America; they play combinations of Cuban tres, accordions, ukulele, guitar, harmonica and vocals.\n\nThey have always been drawn to collaborating with artists from all countries and they enjoy most of all the parties and festivals that celebrate a strong sense of community and equality in diversity.\n\nTickets for this Floating Melodies; as part of both the Umbrella Festival and Guitars in Bars; will include a local beverage and local produce from The Vegan Catering Company.\n\nYou will also be able to dance the night away with the portable dance floor being set up on the dock for once the cruise is complete!\n\nTickets start from $36 and..."},{"title":"Learn the Art of Chinese Painting with Confucius Insitute","link":"http://www.adelaidecitycouncil.com/whats-on/event/learn-the-art-of-chinese-painting-with-confucius-insitute","author":"","date":"2016-08-08T14:00:00","description":"This workshop introduces the traditional art of Chinese water-colour painting \u0026amp; results in beautiful pieces of art. Presented by Confucius Institute at the University of Adelaide in partnership with Adelaide City Libraries, this is an initiative as part of SALA festival 2016.\n\nMonday 8th August, 2pm to 3pm (City Library) \u0026amp; Tuesday 16th August, 11am to 12pm (Hutt St Library) Free event. Bookings essential.\n"},{"title":"Guitars in Bars (and Other Places)","link":"http://www.adelaidecitycouncil.com/whats-on/event/guitars-in-bars-and-other-places","author":"","date":"2016-08-10T12:00:00","description":"Guitars in Bars and other places is taking the Adelaide Guitar Festival to the pubs, clubs, bars, restaurants and exhibition spaces across South Australia with a series of free and ticketed gigs.\u0026nbsp;Featuring the best of Adelaide\u0027s live music scene, it\u0027s a large\u0026nbsp;aperitif leading up to the main event.\n\nMat Brooker is guitarist with an acoustic Latin fusion and will be performing a special lunchtime concert in Studio 1 at City Library.\n"},{"title":"Project Ion","link":"http://www.adelaidecitycouncil.com/whats-on/event/project-ion","author":"","date":"2016-08-11T00:00:00","description":"Presented and curated by Format Collective, PROJECT // ION is a program of weird, rare and experimental films projected in the front window of Format Systems on Hindley Street. The program continues for five weeks, with new artists introduced every Friday. Artists include Matea Gluscevic (SA), Jen Mathews (Vic), NIgel Koop (SA) and Alex Gordon-Smith (Tas). Make sure you head down to Hindley Street and check it out!\n"},{"title":"Adelaide Film Club - City Library: Visitors ","link":"http://www.adelaidecitycouncil.com/whats-on/event/adelaide-film-club-city-library-visitors","author":"","date":"2016-08-11T12:00:00","description":"This month\u0027s theme: ART\n\nCity Library screening:\n\nVisitors – A non verbal feast for the eyes about humans relationship with technology\nThursday 11th August 12-2pm\n\nJoin fellow film lovers for our regular Film Club! Two films from our online resource Beamafilm are screened at City Library and Hutt Street Library each month. Afterwards you can tell others your thoughts, discussing points from the film that you found interesting.\n\nYou can also participate from home – just visit our Virtual Library page, log in to Beamafilm with your Adelaide library card, then search for this month\u0027s films. Join the discussion on social media by posting with the hashtag #ADLFilmClub.\n"},{"title":"\u0026#8216;Sisters\u0026#8217; - The Confucius Institute SALA Exhibition Opening ","link":"http://www.adelaidecitycouncil.com/whats-on/event/sisters-the-confucius-institute-sala-exhibition-opening","author":"","date":"2016-08-11T15:00:00","description":"Shandong Province, South Australia\u0027s sister state in China, has beautiful rural views that tourists don\u0027t normally see. Traditionally an agricultural state, it was hit\u0026nbsp;by an industrial revolution in the 1980s and its major GDP contributor has shifted to the service industry, there are however still places where you can see the agricultural \u0027Shandong\u0027 of old.\n\nSouth Australia and Shandong became sister states in 1986 and the two states share similar characteristics, from their agricultural base to their classic colonial architecture.\n\nThe Confucius Institute at the University of Adelaide is hosting this exhibition to celebrate the sister relationship between the two states and the two universities. The exhibition will be at our office on Level 4, Kenneth Wills Building at the University of Adelaide, from August 11th to August 31st.\n\nWe invite you to attend the opening of the exhibition, this is a good opportunity for our friends to get together and see CI\u0027s recent art activities. Drinks and snacks will be provided. The event is free to attend but registration is essential.\n\nMore information about our exhibition can be found on the website:\u0026nbsp;https://confucius.adelaide.edu.au/community/sala/\n\nWhen:\u0026nbsp;Thursday, 11 August 2016 from 3:00 PM to 5:00 PM (ACST)\u0026nbsp;\nWhere:\u0026nbsp;The Confucius Institute at the University of Adelaide - Level 4 Kenneth Wills Building, The University of Adelaide, Adelaide, SA 5005\n"},{"title":"Fashion Friday presents: Rundle St East","link":"http://www.adelaidecitycouncil.com/whats-on/event/fashion-friday-presents-rundle-st-east","author":"","date":"2016-08-12T12:00:00","description":"For the first time ever, Rundle St East’s fashion hub is taking a day down on the East End to trek up to Victoria Square for Hilton Adelaide’s Fashion Friday*.\n\nFashion Friday™, exclusive to Hilton Adelaide is one of the most popular events on Adelaide’s social calendar. Offering a relaxed, fun afternoon, guests enjoy a 3-course lunch, indulge in French Champagne and are entertained with two fashion parades by\u0026nbsp;Rundle St East.\n\n\u0026lt;em border-box;\"\u003d\"\"\u0026gt;Seating is subject to table configuration. *Excludes booking \u0026amp; credit card fee. Cancellation policy applies.\n"},{"title":"Setting","link":"http://www.adelaidecitycouncil.com/whats-on/event/setting","author":"","date":"2016-08-13T10:00:00","description":"Whether your novel is based in a well known city or a small imaginary country town, in the outback or beside an ocean, the way you write about setting is a crucial element in shaping your story and creating good fiction.\n\nThis workshop with respected author and teacher Kerryn Goldsworthy will show you how to situate your story in vividly drawn places that create mood and strengthen your characters.\n\nThis workshop will cover: practical exercises and examples for locating your story\n\nPresented by Kerryn Goldsworthy, the author of three books: a collection of short stories, a critical study of the writing of Helen Garner, and a history/travel/memoir book called Adelaide, part of the ‘Cities Series’. She has also published numerous essays, articles, reviews, stories and columns (including on local tourism, for The Adelaide Review). Kerryn taught at Melbourne University for 17 years and has now taught Creative Writing classes and workshops at Melbourne and Adelaide Universities on and off since 1983. \u0026nbsp; \u0026nbsp;\n"},{"title":"Narrative Arc and Structuring Your Novel","link":"http://www.adelaidecitycouncil.com/whats-on/event/narrative-arc-and-structuring-your-novel","author":"","date":"2016-08-13T14:00:00","description":"You may be a brilliant wordsmith, but if your novel lacks a strong narrative arc it will fail to hook your reader and keep them turning the pages.\n\nThis workshop introduces you to the classic narrative arc structure on which most blockbusters – both films and novels – are based. Using examples, the importance of narrative and other structural elements of the novel will be discussed, and through group exercises and discussion, you will develop the skills to apply them to your own writing projects.\n\nParticipants will learn: the formula for a good story and the confidence and new techniques for telling your story.\n\nPresented by Jane Turner Goldsmith - a writer, psychologist and teacher. Her novel Poinciana (Wakefield Press, 2006) was shortlisted for a Commonwealth Prize. She has also published short stories, poetry and children’s fiction and edited a non fiction anthology of adoption stories. She has worked as a content writer for the Black Dog Institute, taught fiction writing through TafeSA and edits SA Psychnews. She currently works as student counsellor at the University of Adelaide, and writes on mental health and wellbeing for staff and students.\n"},{"title":"Alternative Processes Workshop with Uta Mooney","link":"http://www.adelaidecitycouncil.com/whats-on/event/alternative-processes-workshop-with-uta-mooney","author":"","date":"2016-08-13T18:13:00","description":"Acrylic processes include image/text transfer, skins, peeling/paper techniques, mottled paint effects, textures, altered papers. Taught by Uta Mooney, cost includes all materials. Brought to the Gallery by Contempo Art Collections.\u0026nbsp;\n"},{"title":"Writing Successful Funding Applications","link":"http://www.adelaidecitycouncil.com/whats-on/event/writing-successful-funding-applications-1","author":"","date":"2016-08-14T10:00:00","description":"A successful arts grant can help writers and artists establish a long term career and create new opportunities for themselves and their artistic community. So why do so many applications fall short of success?\n\nA good idea is not enough – you also need to be able to quickly and professionally convey your project in a way that sweeps the assessors up in your passion and vision.\n\nIn this exclusive workshop, you will learn how to turn your brilliant creative idea into a stand out grant application. You’ll be provided with industry knowledge on how to write a successful arts funding application – for both individuals and projects. You’ll explore why some applications are successful and go straight to the top of the pile, why others aren’t and, as a special bonus, you’ll get a rare insight into assessment processes to give you a “leg up” in your applications.\n\nParticipants will learn: the five key elements to every successful grant application and how to clearly address selection criteria and demonstrate grant requirements\n\nPresented by Sarah Tooth, who is the Director of the SA Writers Centre and has worked in the arts for more than 20 years, as a writer, community arts worker, screen producer, arts manager, programmer and creative producer, working for organisations as diverse as Brown’s Mart Community Arts, the ABC’s international television service (Australia Network), and the Ubud Writers \u0026amp; Readers Festival. She sits on a number of arts industry and tertiary advisory committees, including the Advisory Committee of Adelaide Writers..."},{"title":"A day with Jane","link":"http://www.adelaidecitycouncil.com/whats-on/event/a-day-with-jane","author":"","date":"2016-08-14T14:00:00","description":"You are invited to join us for a Sunday afternoon escape, an escape into Jane Austen\u0027s world. Dust off your best regency era costumes and explore the romance to be had with Jane.\n\nWhilst your stomach is digesting, there will be a range of activities for you to participate in from sketching, a game of Jane Austen\u0027s Sweethearts card game created right here in South Australia, cross stitching, letter writing and playing a game of rhymes with rose!\n\nIf you have always wanted to attend a court dance then you need to wait no longer. Local dance teachers from Step by Step Dance Studio will teach you some court dance steps which you will be able to practice to live music!\n\nIndulge yourself by investing $68 on this immersive experience because remember \"Selfishness must always be forgiven you know, because there is no hope of a cure.\" - Mansfield Park\n\n\u0026nbsp;\n\nPlease note this is a three hour event beginning promptly at 2pm.\n"},{"title":"Grant Writing Intensive","link":"http://www.adelaidecitycouncil.com/whats-on/event/grant-writing-intensive-1","author":"","date":"2016-08-14T14:00:00","description":"In part two of Writing Successful Funding Applications workshop, participants\u0026nbsp;will be taken step by step through the process of writing an application, from the first idea to the final proofread. Using real life examples, you’ll review templates and criteria, work through the sticky business of writing a project budget and be guided on how much money to ask for to give the best chance of a successful outcome.\n\nBring along your project idea and get ready to workshop it into the beginnings of a brilliant, stand out application!\n\n\n\nPlease note: this workshop is only open to previous attendees of \u0026lt;span #343434;\u003d\"\" text-decoration:\u003d\"\" none;\u003d\"\" text-underline:\u003d\"\" none;\"\u003d\"\"\u0026gt;Writing Successful Funding Applications.\n"},{"title":"SCINEMA International Science Film Festival 2016","link":"http://www.adelaidecitycouncil.com/whats-on/event/scinema-international-science-film-festival-2016","author":"","date":"2016-08-17T16:30:00","description":"In partnership with RiAus, the City Library will be hosting award winning films. Come along \u0026amp; join in the discovery with this exciting program of long \u0026amp; short award winning science films.\n\nWednesday August 17th, 4.30pm to 6pm \u0026amp; Thursday August 18th, 12pm to 2pm\n"},{"title":"Men\u0026#8217;s Cooking Workshop","link":"http://www.adelaidecitycouncil.com/whats-on/event/mens-cooking-workshop-1","author":"","date":"2016-08-18T14:00:00","description":"Come to the Adelaide South West Community Centre for a fun afternoon of cooking and eating!\n\nLearn to plan and cook/bake a home made meal to enjoy yourself, with family or friends.\n\nBookings Essential as places are strictly limited\n"},{"title":"The Best of SCINEMA International Science Film Festival 2016","link":"http://www.adelaidecitycouncil.com/whats-on/event/the-best-of-scinema-international-science-film-festival-2016","author":"","date":"2016-08-18T18:00:00","description":"6pm - Community dinner, bring along a plate of food to share.\n7pm - Screening \u0027Best of SCINEMA\u0027 2 hours 5 minute program.\nhttp://bit.ly/2aejcpd\n\nThe Adelaide Sustainability Centre is supported by the Adelaide Mount Lofty Ranges NRM Board.\n#SCINEMA2016\n#natsciwk\n"},{"title":"Experimenta Recharge","link":"http://www.adelaidecitycouncil.com/whats-on/event/experimenta-recharge","author":"","date":"2016-08-19T11:00:00","description":"For two decades Experimenta, Australia’s pre-eminent media arts organisation, has showcased dynamic and challenging contemporary art that intersects with digital media, science and technology and design. Works in Recharge draw upon photography, biology, sculpture and installation, electromagnetics, sound art, robotics, gaming, dance, the World Wide Web, performance, 3D printing, animation, film, video, and analogue television. Featuring five new commissions, the exhibition presents the work of more than twenty artists from across Australia as well as international artists from Brazil, Germany, Japan, the Netherlands, the UAE and the USA.\n\nExperimenta Recharge is an Hawke Research Institute, UniSA, for the 2016 OzAsia Festival.\n\nImage: Anaisa FRANCO, Paranoia, 2010, reactive sculpture, 15.0 x 11.0 x 20.0 cm. \n\nmage © the artist, courtesy Experimenta Media Arts and RMIT Gallery. Photograph by Mark Ashkanasy.\n"},{"title":"\u0026#8216;Shine\u0026#8217; 20th Anniversary Screening + Q\u0026amp;A with Scott Hicks \u0026amp; Jan Sardi","link":"http://www.adelaidecitycouncil.com/whats-on/event/shine-20th-anniversary-screening-qa-with-scott-hicks-jan-sardi","author":"","date":"2016-08-19T19:00:00","description":"\u0027Shine\u0027 20th Anniversary Screening + Q\u0026amp;A with Scott Hicks \u0026amp; Jan Sardi\n\nFriday 19th August 2016, 7:00pm\n\nSHINE, one of the most celebrated and successful films in Australian cinema history, will have a special screening at the Capri on\u0026nbsp;Friday\u0026nbsp;August 19 to celebrate the 20th\u0026nbsp;anniversary of its Australian release. \u0026nbsp;Director Scott Hicks and screenwriter Jan Sardi will join us for a Q\u0026amp;A following the screening. \u0026nbsp;\n\nSHINE is the true story of pianist David Helfgott, his turbulent relationship with his father, his breakdown and eventual redemption through the love of his wife, Gillian.\n\nSHINE swept the pool of local awards in 1996, winning nine AFI Awards. The following year SHINE became an international phenomenon scoring seven Oscar®\u0026nbsp;nominations, five Golden Globe nominations and nine BAFTA nominations amongst many other international awards. After Geoffrey Rush was awarded an Oscar, a Golden Globe and a BAFTA for Best Actor, his acting career was completely transformed.\n\nTickets on sale now for this very spcial event!\n\n\u0026nbsp;\n"},{"title":"Red Dress - decoupage with painted portrait","link":"http://www.adelaidecitycouncil.com/whats-on/event/red-dress-decoupage-with-painted-portrait","author":"","date":"2016-08-20T09:30:00","description":"Judith Hombsch is a self-taught artist and has a passion for texture, colour and use of different mediums. In this workshop you will explore the use of decoupage.\u0026nbsp;Cost includes all materials and morning tea.Please bring your own gloves and apron.\u0026nbsp;\n"},{"title":"M/Y Steve Irwin Ship Tours and Laneway Market","link":"http://www.adelaidecitycouncil.com/whats-on/event/m-y-steve-irwin-ship-tours-and-laneway-market","author":"","date":"2016-08-20T10:00:00","description":"From 10:00 to 16:30 on Saturday 20th August and Sunday 21st August the Great Australian Bight Alliance will be running ship tours of the Sea Shepherd vessel the M/Y Steve Irwin, along with a fun laneway market and kids’ activities.\n\nShip tours will run every half an hour for a gold coin donation and include the opportunity to see exclusive footage from Operation Jeedara and the Great Australian Bight. The event will be opened with a Greeting to Country by Karl Telfer that includes a traditional dance and smoking ceremony. The laneway market includes community stalls from Great Australian Bight Alliance members including Sea Shepherd, The Wilderness Society, and the Bob Brown Foundation. Entertainment includes live acoustic music and children’s activities run by the Great Australian Bight Alliance. Food will be available from food trucks that include Red Lime Shack and Instasalad.\n"},{"title":"Flinders Ranges - acrylic on canvas","link":"http://www.adelaidecitycouncil.com/whats-on/event/flinders-ranges-acrylic-on-canvas","author":"","date":"2016-08-20T13:30:00","description":"Judith Hombsch is a self-taught artist who has also attended The Central School of Art. Judit has been painting most of her life and has a passion for texture and colour. Cost of he workshop includes all materials and afternoon tea. Please bring own gloves and apron.\n"},{"title":"Norwood Toy, Model Trains \u0026amp; Cars Swapmeet","link":"http://www.adelaidecitycouncil.com/whats-on/event/norwood-toy-model-trains-cars-swapmeet","author":"","date":"2016-08-21T10:00:00","description":"Swapmeet/ Market\n\nWhere you can buy or sell your model cars, trains, collectable toys, plastic kits, slot cars, toy soldiers, tin toys \u0026amp; movie collectables.\n"},{"title":"Flourish - acrylic on canvas painted with fingers! ","link":"http://www.adelaidecitycouncil.com/whats-on/event/flourish-acrylic-on-canvas-painted-with-fingers","author":"","date":"2016-08-27T09:30:00","description":"Judith Hombsch is a self-taught artist who has also studied at the Central School of Art. She enjoys abstract painting, self-expression and has a passion for texture and colour. Cost of the workshop includes all materials and morning tea. Please bring own gloves and apron. \u0026nbsp;\n"},{"title":"Writing Business Secrets","link":"http://www.adelaidecitycouncil.com/whats-on/event/writing-business-secrets-1","author":"","date":"2016-08-27T10:00:00","description":"Recent studies have shown that only 1 in 20 Australian writers makes a full-time living from the pen. So how can you maximise your chances of being the one in twenty who makes it happen?\n\nThe answer can be as simple as not thinking like a writer and starting to think like an entrepreneur or business leader instead!\n\nThis workshop will help you create the foundations you need to build a successful writing business and reveal the writing business secrets that most writers simply don\u0027t know.\n\nParticipants will learn: why the basics of leadership, management and operations matter\n\nPresented by Dr. Scott Zarcinas, the Director of DoctorZed Publishing and the author of eight books, including Samantha Honeycomb and Your Natural State of Being. As a publisher he has edited more than 40 books and overseen the publication of over 100 titles. Since 2011, he has been the Chairman of the Australian Digital Publishing Group and is part of the SA Writers Centre mentor program.\n\n\u0026lt;span lang\u003d\"EN-US\" calibri;\u003d\"\" mso-bidi-font-family:\u003d\"\" verdana;\u003d\"\" color:\u003d\"\" #343434;\u003d\"\" mso-ansi-language:\u003d\"\" en-us;\"\u003d\"\"\u0026gt;\n"},{"title":"Granny \u0026amp; Grandpa Skills-Fest","link":"http://www.adelaidecitycouncil.com/whats-on/event/granny-grandpa-skills-fest","author":"","date":"2016-08-28T00:00:00","description":"Granny \u0026amp; Grandpa Skills-Fest: Sharing Tradition, Skills \u0026amp; Knowledge\n\nRemember what you learnt in the kitchen with Yiayia? Or out in the garden with Nonno?\n\nJoin us at the Migration Museum at this FREE event\u0026nbsp;to celebrate and share the heritage, culture, skills, knowledge and traditions of our elders - passing down what granny and grandpa know best. Shed, gardening and kitchen skills will be a feature of the day, travelling back to a time before large chain supermarkets and warehouses dominated the streets.\n\nWorkshops, demonstrations, performances, kid’s activities, food and more for the whole family to enjoy.\n\nDon’t forget to bring an object or a story about a skill, tradition or family activity you have shared with your grandparent or parents.\n\nThis event has been collaboratively curated by Rebecca Sullivan \u0026amp; Warndu, Natural Resources Adelaide \u0026amp; Mt Lofty Ranges and the Migration Museum.\n\nClick \u0027going\u0027 on the Facebook Event to recieve updates!\n"},{"title":"Writing Sexual and Gender Diversity","link":"http://www.adelaidecitycouncil.com/whats-on/event/writing-sexual-and-gender-diversity-1","author":"","date":"2016-08-28T10:00:00","description":"We need more LGBTQIA characters in our fiction, but straight, cisgender writers are often wary of including them, knowing that poorly informed representation can do more harm than good.\n\nThis workshop will equip writers with the knowledge they need to navigate the politics and ethics of representing gay and trans people in literature. It will include an overview of the history of the gay rights movement, and of the different ways in which homosexuality and gender diversity have been understood, both by society at large and by queer people themselves. Writers of realist and speculative fiction are equally welcome.\n\nWe’ll be covering: common stereotypes and pitfalls to avoid and·what disagreements and debates exist within gay and trans communities over ideal representation, and how to negotiate them\n\nVoiceworks and he has written for ActNow Theatre. He has also been a volunteer at the Feast Queer Youth Drop In for the past two and a half years.\n"},{"title":"Creative Writing 101 with David Chapple","link":"http://www.adelaidecitycouncil.com/whats-on/event/creative-writing-101-with-david-chapple-1","author":"","date":"2016-08-28T14:00:00","description":"Are you looking for inspiration to start your creative writing journey? If you have passion, ideas and motivation then this workshop will add technique and confidence to your armoury, as well as offering a range of approaches to generate great writing. Not only will you discover your writing voice and form but you’ll also uncover your strengths and unearth new confidence to complete your creative projects.\n\nIf you want to write creatively for yourself, or others, then this workshop will show you the breadth of contemporary writing practice, the challenges of the industry and the rewards of a life with words.\n\nThis workshop is ideal for beginners or those who want to refresh their skills.\n\n\n\nPresented by David Chapple, who is the Writing Development Manager at the SA Writers Centre. Chapple spends his working life finding fantastic writers in surprising environments. He holds a Masters in Creative Writing, specialising in Writing and Health and has worked as the writer in residence in mental health projects, disability services and hospitals. He has also shared his unique approach to teaching creative writing within schools and prisons and has delivered creative writing projects for \u0026lt;em normal;\"\u003d\"\"\u0026gt;The Big Issue, Flinders Medical Centre, Common Ground and Adelaide Cemeteries Authority.\n"}]